artillery-script.yml
config:
  target: "http://localhost:5001/api/nearbyworkspaces"
  phases:
    - duration: 10
      arrivalRate: 10
      name: Warm up phase
    - duration: 10
      arrivalRate: 5
      rampTo: 100
      name: Ramp up load
    - duration: 10
      arrivalRate: 100
      name: Sustained load
scenarios:
  - flow:
    - get:
        # url: "/buildings/artillery/23/"
        url: "/buildings/23/"
    # - post:
    #       url: "/buildings/artillery/10000002"
    #       json:
    #         long: "-92.701"
    #         lat: "35.5889"