artillery-script.yml
config:
  target: "http://localhost:5001/api/nearbyworkspaces"
  phases:
    - duration: 1
      arrivalRate: 2
scenarios:
  - flow:
    - get:
        url: "/buildings/23/"
    - post:
          url: "/buildings/artillery/10000002"
          json:
            long: "-92.701"
            lat: "35.5889"